#include "Utility/StringUtil.h"
#include <ctype.h>
#include <string.h>
#include <wctype.h>
#include <algorithm>

namespace dk
{
namespace utility
{

const wchar_t* s_hanCharsByFirstLetter[] = {
L"啊阿吖嗄腌锕埃挨哎唉哀皑癌蔼矮艾碍爱隘捱嗳嗌嫒瑷暧砹锿霭鞍氨安俺按暗岸胺案谙埯揞犴庵桉铵鹌黯肮昂盎凹敖熬翱袄傲奥懊澳坳拗嗷岙廒遨媪骜獒聱螯鏊鳌鏖",
L"芭捌扒叭吧笆八疤巴拔跋靶把耙坝霸罢爸茇菝岜灞钯粑鲅魃白柏百摆佰败拜稗伯捭掰斑班搬扳般颁板版扮拌伴瓣半办绊阪坂贲钣瘢癍舨邦帮梆榜膀绑棒磅蚌镑傍谤蒡浜苞胞包褒剥薄雹保堡饱宝抱报暴豹鲍爆刨炮勹葆孢煲鸨褓趵龅杯碑悲卑北辈背贝钡倍狈备惫焙被臂孛陂邶埤萆蓓呗悖碚鹎褙鐾鞴奔苯本笨畚坌贲锛蚌崩绷甭泵蹦迸堋嘣甏逼鼻比鄙笔彼碧蓖蔽毕毙毖币庇痹闭敝弊必辟壁臂避陛秘泌匕俾埤芘荜荸萆薜吡哔狴庳愎滗濞弼妣婢嬖璧贲畀铋秕裨筚箅篦舭襞跸髀鞭边编贬扁便变卞辨辩辫遍匾弁苄忭汴缏煸砭碥窆褊蝙笾鳊标彪膘表婊骠杓飑飙飚灬镖镳瘭裱鳔髟鳖憋别瘪蹩彬斌濒滨宾摈傧豳缤玢槟殡膑镔髌鬓兵冰柄丙秉饼炳病并屏禀冫邴摒槟柏百剥薄玻菠播拨钵波博勃搏铂箔伯帛舶脖膊渤泊驳卜孛亳蕃啵饽檗擘礴钹鹁簸趵跛踣堡捕卜哺补埠不布步簿部怖埔卟逋瓿晡钚钸醭",
L"擦嚓礤猜裁材才财睬踩采彩菜蔡餐参蚕残惭惨灿孱骖璨粲黪苍舱仓沧藏伧操糙槽曹草艹嘈漕螬艚厕策侧册测恻参岑涔层蹭曾噌差疵茨磁雌辞慈瓷词此刺赐次伺兹茈呲祠鹚粢糍聪葱囱匆从丛苁淙骢琮璁枞凑楱辏腠粗醋簇促蔟徂猝殂酢蹙蹴蹿篡窜攒汆撺爨镩摧崔催脆瘁粹淬翠萃啐悴璀榱毳隹村存寸忖皴磋撮搓措挫错厝嵯脞锉矬痤瘥鹾蹉躜插叉茬茶查碴搽察岔差诧刹喳嚓猹馇汊姹杈楂槎檫锸镲衩差拆柴豺侪钗瘥虿龇搀掺蝉馋谗缠铲产阐颤单冁谄蒇廛忏潺澶孱羼婵觇禅镡蟾躔昌猖场尝常长偿肠厂敞畅唱倡伥鬯苌菖徜怅惝阊娼嫦昶氅鲳超抄钞朝嘲潮巢吵炒绰剿怊晁耖车扯撤掣彻澈坼屮砗郴臣辰尘晨忱沉陈趁衬称谌谶抻嗔宸琛榇碜龀撑称城橙成呈乘程惩澄诚承逞骋秤盛丞埕噌徵枨柽塍瞠铖铛裎蛏酲吃痴持匙池迟弛驰耻齿侈尺赤翅斥炽傺坻墀茌叱哧啻嗤彳饬媸敕眵鸱瘛褫蚩螭笞篪豉踟魑充冲虫崇宠种重茺忡憧铳舂艟抽酬畴踌稠愁筹仇绸瞅丑臭俦帱惆瘳雠初出橱厨躇锄雏滁除楚础储矗搐触处畜亍刍怵憷绌杵楮樗褚蜍蹰黜揣搋嘬膪踹川穿椽传船喘串舛遄巛氚钏舡疮窗幢床闯创怆疒吹炊捶锤垂陲棰槌春椿醇唇淳纯蠢莼鹑蝽戳绰啜辶辍踔龊",
L"搭达答瘩打大耷哒嗒怛妲沓疸褡笪靼鞑大呆歹傣戴带殆代贷袋待逮怠埭甙呔岱迨骀绐玳黛耽担丹单郸掸胆旦氮但惮淡诞弹蛋赡石儋萏啖澹殚赕眈疸瘅聃箪当挡党荡档谠凼菪宕砀铛裆刀捣蹈倒岛祷导到稻悼道盗刂叨帱忉氘焘纛德得的地锝得澄蹬灯登等瞪凳邓噔嶝戥磴镫簦的堤低滴迪敌笛狄涤翟嫡抵底地蒂第帝弟递缔提氐籴诋谛邸坻荻嘀娣柢棣觌砥碲睇镝羝骶嗲颠掂滇碘点典靛垫电佃甸店惦奠淀殿阽坫巅玷钿癜癫簟踮碉叼雕凋刁掉吊钓调铞铫貂鲷跌爹碟蝶迭谍叠垤堞揲喋牒瓞耋蹀鲽丁盯叮钉顶鼎锭定订仃啶玎腚碇町铤疔耵酊丢铥东冬董懂动栋侗恫冻洞咚岽峒氡胨胴硐鸫兜抖斗陡豆逗痘都蔸窦蚪篼都督毒犊独读堵睹赌杜镀肚度渡妒芏嘟渎椟牍蠹笃髑黩端短锻段断缎椴煅簖堆兑队对怼憝碓墩吨蹲敦顿囤钝盾遁沌炖砘礅盹镦趸度掇哆多夺垛躲朵跺舵剁惰堕驮咄哚沲缍铎裰踱",
L"阿蛾峨鹅俄额讹娥恶厄扼遏鄂饿哦噩谔垩苊莪萼呃愕屙婀轭腭锇锷鹗颚鳄诶恩蒽摁而儿耳尔饵洱二贰迩珥铒鸸鲕",
L"发罚筏伐乏阀法珐垡砝藩帆番翻樊矾钒繁凡烦反返范贩犯饭泛蕃蘩幡梵燔畈蹯坊芳方肪房防妨仿访纺放匚邡枋钫舫鲂菲非啡飞肥匪诽吠肺废沸费芾狒悱淝妃绯榧贲腓斐扉砩镄痱蜚篚翡霏鲱芬酚吩氛分纷坟焚汾粉奋份忿愤粪偾瀵玢棼贲鲼鼢丰封枫蜂峰锋风疯烽逢冯缝讽奉凤俸酆葑唪沣砜佛否缶佛夫敷肤孵扶拂辐幅氟符伏俘服浮涪福袱弗甫抚辅俯釜斧脯腑府腐赴副覆赋复傅付阜父腹负富讣附妇缚咐匐凫阝郛芙芾苻茯莩菔拊呋幞怫滏艴孚驸绂绋桴赙祓砩黻黼罘稃馥蚨蜉蝠蝮麸趺跗鲋鳆",
L"噶嘎夹咖伽尬尕尜旮钆该改概钙盖溉芥丐陔垓戤赅胲干甘杆柑竿肝赶感秆敢赣坩苷尴擀泔淦澉绀橄旰矸疳酐冈刚钢缸肛纲岗港杠扛戆罡筻篙皋高膏羔糕搞镐稿告睾诰郜藁缟槔槁杲锆盖哥歌搁戈鸽胳疙割革葛格蛤阁隔铬个各合咯鬲仡哿圪塥嗝纥搿膈铪镉袼虼舸骼给根跟亘茛哏艮耕更庚羹埂耿梗颈哽赓绠鲠工攻功恭龚供躬公宫弓巩汞拱贡共廾珙肱蚣觥钩勾沟苟狗垢构购够佝诟岣遘媾缑枸觏彀笱篝鞲辜菇咕箍估沽孤姑鼓古蛊骨谷股故顾固雇贾嘏诂菰崮汩梏轱牯牿臌毂瞽罟钴锢鸪鹄痼蛄酤觚鲴鹘刮瓜剐寡挂褂卦诖呱栝胍鸹乖拐怪掴棺关官冠观管馆罐惯灌贯纶倌莞掼涫盥鹳鳏光广逛咣犷桄胱瑰规圭硅归龟闺轨鬼诡癸桂柜跪贵刽炔匦刿庋宄妫桧炅晷皈簋鲑鳜辊滚棍衮绲磙鲧锅郭国果裹过涡馘埚掴呙帼崞猓椁虢锞聒蜾蝈",
L"蛤哈铪骸孩海氦亥害骇还咳嗨胲醢酣憨邯韩含涵寒函喊罕翰撼捍旱憾悍焊汗汉邗菡撖瀚晗焓顸颔蚶鼾夯杭航吭巷行沆绗颃镐壕嚎豪毫郝好耗号浩貉蒿薅嗥嚆濠灏昊皓颢蚝呵喝荷菏核禾和何合盒貉阂河涸赫褐鹤贺吓诃劾壑嗬阖纥曷盍颌蚵翮嘿黑痕很狠恨哼亨横衡恒蘅珩桁轰哄烘虹鸿洪宏弘红黉訇讧荭蕻薨闳泓喉侯猴吼厚候后堠後逅瘊篌糇鲎骺核呼乎忽瑚壶葫胡蝴狐糊湖弧虎唬护互沪户冱唿囫岵猢怙惚浒滹琥槲轷觳烀煳戽扈祜瓠鹄鹕鹱虍笏醐斛鹘花哗华猾滑画划化话骅桦砉铧槐徊怀淮坏踝欢环桓还缓换患唤痪豢焕涣宦幻郇奂垸萑擐圜獾洹浣漶寰逭缳锾鲩鬟荒慌黄磺蝗簧皇凰惶煌晃幌恍谎隍徨湟潢遑璜肓癀蟥篁鳇灰挥辉徽恢蛔回毁悔慧卉惠晦贿秽会烩汇讳诲绘溃诙茴荟蕙咴哕喙隳洄浍彗缋桧晖恚虺蟪麾荤昏婚魂浑混诨馄阍溷珲和豁活伙火获或惑霍货祸劐藿攉嚯夥钬锪镬耠蠖",
L"",
L"给击圾基机畸稽积箕肌饥迹激讥鸡姬绩缉吉极棘辑籍集及急疾汲即嫉级挤几脊己蓟技冀季伎祭剂悸济寄寂计记既忌际妓继纪藉奇系丌亟乩剞佶偈墼芨芰荠萁蒺蕺掎叽咭哜唧岌嵴洎彐屐骥畿玑楫殛戟戢赍觊犄齑矶羁嵇稷瘠虮笈笄暨跻跽霁鲚鲫髻麂嘉枷夹佳家加荚颊贾甲钾假稼价架驾嫁茄嘏伽郏葭岬浃迦珈戛胛恝铗铪镓痂瘕袷蛱笳袈跏歼监坚尖笺间煎兼肩艰奸缄茧检柬碱硷拣捡简俭剪减荐槛鉴践贱见键箭件健舰剑饯渐溅涧建僭谏谫谮菅蒹搛囝湔蹇謇缣枧楗戋戬牮犍毽腱睑锏鹣裥笕翦趼踺鲣鞯虹僵姜将浆江疆蒋桨奖讲匠酱降强茳洚绛缰犟礓耩糨豇蕉椒礁焦胶交郊浇骄娇嚼搅铰矫侥脚狡角饺缴绞剿教酵轿较叫窖觉校佼僬艽茭挢噍峤徼姣敫皎鹪蛟醮跤鲛揭接皆秸街阶截劫节桔杰捷睫竭洁结解姐戒藉芥界借介疥诫届偈讦诘卩拮喈嗟婕孑桀碣锴疖颉蚧羯鲒骱巾筋斤金今津襟紧锦仅谨进靳晋禁近烬浸尽劲卺荩堇噤馑廑妗缙瑾槿赆觐钅衿矜劲荆兢茎睛晶鲸京惊精粳经井警景颈静境敬镜径痉靖竟竞净刭儆阱陉菁獍憬泾迳弪婧肼胫腈旌靓炯窘冂迥扃揪究纠玖韭久灸九酒厩救旧臼舅咎就疚僦啾阄柩桕鸠鹫赳鬏车柜鞠拘狙疽居驹菊局咀矩举沮聚拒据巨具距踞锯俱句惧炬剧倨讵苣苴莒掬遽屦琚枸椐榘榉橘犋飓钜锔窭裾趄醵踽龃雎瞿鞫捐鹃娟倦眷卷绢圈鄄狷涓桊蠲锩镌隽嚼脚角撅攫抉掘倔爵觉决诀绝厥劂谲矍堀蕨噘崛獗孓珏桷橛爝镢蹶觖龟均菌钧军君峻俊竣浚郡骏捃皲筠麇",
L"喀咖卡咯佧咔胩开揩楷凯慨剀垲蒈忾恺铠锎锴槛刊堪勘坎砍看侃凵莰阚戡龛瞰康慷糠扛抗亢炕伉闶钪考拷烤靠尻栲犒铐呵坷苛柯棵磕颗科壳咳可渴克刻客课嗑岢恪溘骒缂珂轲氪瞌钶铪锞稞疴窠颏蚵蝌髁肯啃垦恳裉坑吭胫铒铿空恐孔控倥崆箜抠口扣寇芤蔻叩眍筘枯哭窟苦酷库裤刳堀喾绔骷夸垮挎跨胯侉锞会块筷侩快蒯郐哙狯脍宽款髋匡筐狂框矿眶旷况诓诳邝圹夼哐纩贶亏盔岿窥葵奎魁傀馈愧溃馗匮夔隗蒉揆喹喟悝愦逵暌睽聩蝰篑跬坤昆捆困悃阃琨锟醌鲲髡括扩廓阔蛞",
L"垃拉喇蜡腊辣啦落剌邋旯砬瘌莱来赖崃徕涞濑赉睐铼癞籁蓝婪栏拦篮阑兰澜谰揽览懒缆烂滥岚漤榄斓罱镧褴琅榔狼廊郎朗浪莨蒗啷阆锒稂螂捞劳牢老佬姥酪烙涝落络唠崂栳铑铹痨耢醪勒乐了仂叻泐鳓勒雷镭蕾磊累儡垒擂肋类泪羸诔嘞嫘缧檑耒酹棱楞冷塄愣厘梨犁黎篱狸离漓理李里鲤礼莉荔吏栗丽厉励砾历利傈例俐痢立粒沥隶力璃哩鬲俪俚郦坜苈莅蓠藜呖唳喱猁溧澧逦娌嫠骊缡枥栎轹戾砺砬詈罹锂鹂疠疬蛎蜊蠡笠篥粝醴跞雳鲡鳢黧俩联莲连镰廉怜涟帘敛脸链恋炼练蔹奁潋濂琏楝殓臁裢裣蠊鲢俩粮凉梁粱良两辆量晾亮谅墚莨椋踉魉撩聊僚疗燎寥辽潦了撂镣廖料蓼尥嘹獠寮缭钌鹩列裂烈劣猎冽埒捩咧洌趔躐鬣琳林磷霖临邻鳞淋凛赁吝拎蔺啉嶙廪懔遴檩辚膦瞵粼躏麟棱玲菱零龄铃伶羚凌灵陵岭领另令酃苓呤囹泠绫柃棂瓴聆蛉翎鲮溜琉榴硫馏留刘瘤流柳六碌陆浏遛骝绺旒熘锍镏鹨鎏咯龙聋咙笼窿隆垄拢陇弄垅茏泷珑栊胧砻癃楼娄搂篓漏陋露偻蒌喽嵝镂瘘耧蝼髅六芦卢颅庐炉掳卤虏鲁麓碌露路赂鹿潞禄录陆戮绿垆撸噜泸渌漉逯璐栌橹轳辂辘贲氇胪镥鸬鹭簏舻鲈驴吕铝侣旅履屡缕虑氯律率滤绿偻捋闾榈膂稆褛掠略锊峦挛孪滦卵乱脔娈栾鸾銮抡轮伦仑沦纶论囵铬咯烙萝螺罗逻锣箩骡裸落洛骆络倮蠃荦捋摞猡泺漯珞椤脶硌镙瘰雒",
L"呒妈麻玛码蚂马骂嘛吗摩抹唛犸嬷杩蟆埋买麦卖迈脉劢荬霾埋瞒馒蛮满蔓曼慢漫谩墁幔缦熳镘颟螨鳗鞔芒茫盲氓忙莽邙漭硭蟒猫茅锚毛矛铆卯茂冒帽貌贸袤茆峁泖瑁昴牦耄旄懋瞀蝥蟊髦么玫枚梅酶霉煤没眉媒镁每美昧寐妹媚莓嵋猸浼湄楣镅鹛袂魅门闷们扪焖懑钔萌蒙檬盟锰猛梦孟勐甍瞢懵朦礞虻蜢蠓艋艨眯醚靡糜迷谜弥米秘觅泌蜜密幂芈冖谧蘼咪嘧猕汨宓弭纟脒祢敉糸縻麋棉眠绵冕免勉娩缅面沔渑湎宀腼眄苗描瞄藐秒渺庙妙喵邈缈缪杪淼眇鹋蔑灭乜咩蠛篾民抿皿敏悯闽苠岷闵泯缗玟珉愍黾鳘明螟鸣铭名命冥茗溟暝瞑酩谬缪脉没摸摹蘑模膜磨摩魔抹末莫墨默沫漠寞陌万谟茉蓦馍嫫殁镆秣瘼耱貊貘麽谋牟某侔哞缪眸蛑鍪模牟拇牡亩姆母墓暮幕募慕木目睦牧穆仫坶苜沐毪钼",
L"拿哪呐钠那娜纳捺肭镎衲氖乃奶耐奈鼐佴艿萘柰南男难喃囡楠腩蝻赧囊攮囔馕曩挠脑恼闹淖孬垴呶猱瑙硇铙蛲哪呢讷馁内嫩恁能嗯呢妮霓倪泥尼拟你匿腻逆溺伲坭猊怩昵旎祢慝睨铌鲵蔫拈年碾撵捻念廿埝辇黏鲇鲶娘酿鸟尿茑嬲脲袅捏聂孽啮镊镍涅乜陧蘖嗫颞臬蹑您柠狞凝宁拧泞佞咛甯聍牛扭钮纽拗狃忸妞脓浓农弄侬哝耨奴努怒弩胬孥驽女恧钕衄虐疟暖娜挪懦糯诺傩搦喏锘",
L"哦喔噢欧鸥殴藕呕偶沤区讴怄瓯耦",
L"扒耙啪趴爬帕怕琶葩杷筢拍排牌徘湃派迫俳蒎哌番攀潘盘磐盼畔判叛胖拚丬爿泮贲袢襻蟠蹒膀磅镑乓庞旁耪胖彷滂逄螃抛咆刨炮袍跑泡匏狍庖脬疱呸胚培裴赔陪配佩沛辔帔旆锫醅霈喷盆湓砰抨烹澎彭蓬棚硼篷膨朋鹏捧碰堋嘭怦蟛辟否坯砒霹批披劈琵毗啤脾疲皮匹痞僻屁譬丕仳陂陴邳郫圮埤鼙芘擗噼庀淠媲纰枇甓睥罴铍癖裨疋蚍蜱貔扁便篇偏片骗谝骈缏犏胼翩蹁飘漂瓢票朴剽嘌嫖骠缥殍瞟螵撇瞥丿苤氕拼频贫品聘姘嫔榀牝颦冯乒坪苹萍平凭瓶评屏俜娉枰鲆泊繁坡泼颇婆破魄迫粕朴叵陂鄱珀攴攵钋钷皤笸剖裒掊堡暴脯扑铺仆莆葡菩蒲埔朴圃普浦谱曝瀑匍噗溥濮璞氆镤镨蹼",
L"稽缉期欺栖戚妻七凄漆柒沏其棋奇歧畦崎脐齐旗祈祁骑起岂乞企启契砌器气迄弃汽泣讫亟亓俟圻芑芪荠萋葺蕲嘁屺岐汔淇骐绮琪琦杞桤槭耆欹祺憩碛颀蛴蜞綦綮蹊鳍麒卡掐恰洽葜袷髂牵扦钎铅千迁签仟谦乾黔钱钳前潜遣浅谴堑嵌欠歉纤倩佥阡芊芡茜荨掮岍悭慊骞搴褰缱椠犍肷愆钤虔箝羟枪呛腔羌墙蔷强抢丬戕嫱樯戗炝锵镪襁蜣羟跄壳橇锹敲悄桥瞧乔侨巧鞘撬翘峭俏窍雀劁诮谯荞峤愀憔缲樵硗铫跷鞒切茄且怯窃伽郄惬慊妾挈锲箧趄钦侵亲秦琴勤芹擒禽寝沁芩揿吣嗪噙廑檎锓矜覃螓衾亲青轻氢倾卿清擎晴氰情顷请庆苘圊檠磬锖蜻罄箐綮謦鲭黥琼穷邛茕穹蛩筇跫銎仇龟秋丘邱球求囚酋泅俅巯犰湫逑遒楸赇虬蚯蝤裘糗鳅趋区蛆曲躯屈驱渠取娶龋趣去戌诎劬凵苣蕖蘧岖衢阒璩觑氍朐祛磲鸲癯蛐蠼麴瞿黢圈颧权醛泉全痊拳犬券劝诠荃犭悛绻辁畎铨蜷筌鬈缺炔瘸却鹊榷确雀阕阙悫鼽裙群逡麇",
L"然燃冉染苒蚺髯瓤壤攘嚷让禳穰饶扰绕荛娆桡惹热喏壬仁人忍韧任认刃妊纫亻仞荏葚饪轫稔衽扔仍日戎茸蓉荣融熔溶容绒冗嵘狨榕肜蝾揉柔肉糅蹂鞣茹蠕儒孺如辱乳汝入褥蓐薷嚅洳溽濡缛铷襦颥软阮朊蕊瑞锐芮蕤枘睿蚋闰润若弱偌箬",
L"撒洒萨卅仨脎飒腮鳃塞赛噻三叁伞散馓毵糁桑嗓丧搡磉颡搔骚扫嫂埽缫臊瘙鳋塞瑟色涩啬铯穑森僧斯撕嘶思私司丝死肆寺嗣四伺似饲巳厮俟兕厶咝饣汜泗澌姒驷缌祀锶鸶耜蛳笥松耸怂颂送宋讼诵凇菘崧嵩忪悚淞竦搜艘擞嗽叟薮嗖嗾馊溲飕瞍锼螋苏酥俗素速粟僳塑溯宿诉肃缩夙谡蔌嗉愫涑簌觫稣酸蒜算狻尿虽隋随绥髓碎岁穗遂隧祟谇荽濉邃燧眭睢孙损笋荪狲飧榫隼莎蓑梭唆缩琐索锁所唢嗦嗍娑桫挲睃羧莎砂杀刹沙纱傻啥煞杉厦唼歃铩痧裟霎鲨色筛晒掺单珊苫杉山删煽衫闪陕擅赡膳善汕扇缮栅剡讪鄯埏芟彡潸姗嬗骟膻禅钐疝蟮舢跚鳝髟墒伤商赏晌上尚裳垧绱殇熵觞鞘梢捎稍烧芍勺韶少哨邵绍劭苕潲杓蛸筲艄奢赊蛇舌舍赦摄射慑涉社设折厍佘揲猞滠歙畲铊麝谁参砷申呻伸身深娠绅神沈审婶甚肾慎渗什诜谂莘葚哂渖椹胂矧蜃乘声生甥牲升绳省盛剩胜圣嵊渑晟眚笙匙师失狮施湿诗尸虱十石拾时什食蚀实识史矢使屎驶始式示士世柿事拭誓逝势是嗜噬适仕侍释饰氏市恃室视试似殖峙谥埘莳蓍弑饣轼贳炻礻铈铊螫舐筮酾豕鲥鲺收手首守寿授售受瘦兽扌狩绶艏蔬枢梳殊抒输叔舒淑疏书赎孰熟薯暑曙署蜀黍鼠属术述树束戍竖墅庶数漱恕丨倏塾菽摅沭澍姝纾毹腧殳镯秫疋刷耍唰率摔衰甩帅蟀栓拴闩涮霜双爽泷孀水睡税说氵吮瞬顺舜数说硕朔烁蒴搠妁槊铄",
L"塌他它她塔獭挞蹋踏拓闼溻漯遢榻沓铊趿鳎胎苔抬台泰酞太态汰邰薹骀肽炱钛跆鲐弹坍摊贪瘫滩坛檀痰潭谭谈坦毯袒碳探叹炭郯澹昙赕忐钽锬镡覃汤塘搪堂棠膛唐糖倘躺淌趟烫傥帑饧溏瑭樘铛铴镗耥螗螳羰醣掏涛滔绦萄桃逃淘陶讨套鼗叨啕洮韬焘饕特忒忑铽藤腾疼誊滕梯剔踢锑提题蹄啼体替嚏惕涕剃屉倜荑悌逖绨缇鹈裼醍天添填田甜恬舔腆掭忝阗殄畋钿锘调挑条迢眺跳佻苕祧铫窕蜩笤粜龆鲦髫贴铁帖萜锇餮厅听烃汀廷停亭庭挺艇莛葶婷梃铤蜓霆通桐酮瞳同铜彤童桶捅筒统痛佟僮仝垌茼嗵峒恸潼砼偷投头透亠钭骰凸秃突图徒途涂屠土吐兔堍荼菟钍酴湍团抟彖疃推颓腿蜕褪退煺囤褪吞屯臀氽饨暾豚说拖托脱鸵陀驮驼椭妥拓唾乇佗坨庹沱柝柁橐砣铊箨酡跎鼍",
L"",
L"",
L"挖哇蛙洼娃瓦袜佤娲腽歪外崴蔓豌弯湾玩顽丸烷完碗挽晚皖惋宛婉万腕剜芄莞菀纨绾琬脘畹蜿鞔汪王亡枉网往旺望忘妄罔尢惘辋魍威巍微危韦违桅围唯惟为潍维苇萎委伟伪尾纬未蔚味畏胃喂魏位渭谓尉慰卫偎诿隈隗圩葳薇囗帏帷崴嵬猥猬闱沩洧涠逶娓玮韪軎炜煨痿艉鲔瘟温蚊文闻纹吻稳紊问刎阌汶玟璺雯嗡翁瓮蓊蕹挝蜗涡窝我斡卧握沃倭莴喔幄渥肟硪龌恶巫呜钨乌污诬屋无芜梧吾吴毋武五捂午舞伍侮坞戊雾晤物勿务悟误兀仵阢邬圬芴唔庑怃忤浯寤迕妩婺骛杌牾於焐鹉鹜痦蜈鋈鼯",
L"昔熙析西硒矽晰嘻吸锡牺稀息希悉膝夕惜熄烯溪汐犀檄袭席习媳喜铣洗系隙戏细匚僖兮隰郗茜菥葸蓰奚唏徙饩阋浠淅屣嬉玺樨曦觋欷歙熹禊禧皙穸裼蜥螅蟋舄舾羲粞翕醯蹊鼷瞎虾匣霞辖暇峡侠狭下厦夏吓呷狎遐瑕柙硖罅黠铣洗掀锨先仙鲜纤咸贤衔舷闲涎弦嫌显险现献县腺馅羡宪陷限线冼苋莶藓岘猃暹娴氙燹祆鹇痃痫蚬筅籼酰跣跹霰降相厢镶香箱襄湘乡翔祥详想响享项巷橡像向象芗葙饷庠骧缃蟓鲞飨萧硝霄削哮嚣销消宵淆晓小孝校肖啸笑效哓潇逍骁绡枭枵蛸筱箫魈解楔些歇蝎鞋协挟携邪斜胁谐写械卸蟹懈泄泻谢屑血叶偕亵勰燮薤撷獬廨渫瀣邂绁缬榭榍颉躞鲑骱薪芯锌欣辛新忻心信衅囟馨莘忄昕歆镡鑫省星腥猩惺兴刑型形邢行醒幸杏性姓陉荇荥擤饧悻硎兄凶胸匈汹雄熊芎臭宿休修羞朽嗅锈秀袖绣咻岫馐庥溴鸺貅髹墟戌需虚嘘须徐许蓄酗叙旭序畜恤絮婿绪续吁诩勖圩蓿洫浒溆顼栩煦盱胥糈醑券轩喧宣悬旋玄选癣眩绚儇谖萱揎泫渲漩璇楦暄炫煊碹铉镟削靴薛学穴雪血谑噱泶踅鳕浚勋熏循旬询寻驯巡殉汛训讯逊迅巽郇埙荀荨蕈薰峋徇獯恂洵浔曛窨醺鲟",
L"压押鸦鸭呀丫芽牙蚜崖衙涯雅哑亚讶轧伢垭揠岈迓娅琊桠氩砑睚痖疋铅焉咽阉烟淹盐严研蜒岩延言颜阎炎沿奄掩眼衍演艳堰燕厌砚雁唁彦焰宴谚验殷厣赝剡俨偃兖讠谳阽郾鄢芫菸崦恹闫阏湮滟妍嫣琰檐晏胭腌焱罨筵酽魇餍鼹鼽殃央鸯秧杨扬佯疡羊洋阳氧仰痒养样漾徉怏泱炀烊恙蛘鞅侥啮疟邀腰妖瑶摇尧遥窑谣姚咬舀药要耀钥夭爻吆崤崾徭幺珧杳轺曜肴铫鹞窈繇鳐邪咽椰噎耶爷野冶也页掖业叶曳腋夜液盅靥谒邺揶琊晔烨铘艾尾一壹医揖铱依伊衣颐夷遗移仪胰疑沂宜姨彝椅蚁倚已乙矣以艺抑易邑屹亿役臆逸肄疫亦裔意毅忆义益溢诣议谊译异翼翌绎刈劓佚佾诒阝圯埸懿苡荑薏弈奕挹弋呓咦咿噫峄嶷猗饴怿怡悒漪迤驿缢殪轶贻欹旖熠眙钇铊镒镱痍瘗癔翊衤蜴舣羿翳酏黟茵荫因殷音阴姻吟银淫寅饮尹引隐印胤鄞廴垠堙茚吲喑狺夤洇湮氤铟瘾窨蚓霪龈英樱婴鹰应缨莹萤营荧蝇迎赢盈影颖硬映嬴郢茔荥莺萦蓥撄嘤膺滢潆瀛瑛璎楹媵鹦瘿颍罂哟育唷拥佣臃痈庸雍踊蛹咏泳涌永恿勇用俑壅墉喁慵邕镛甬鳙饔幽优悠忧尤由邮铀犹油游酉有友右佑釉诱又幼卣攸侑莠莜莸尢呦囿宥柚猷牖铕疣蚰蚴蝣蝤繇鱿黝鼬蔚尉迂淤于盂榆虞愚舆余俞逾鱼愉渝渔隅予娱雨与屿禹宇语羽玉域芋郁吁遇喻峪御愈欲狱育誉浴寓裕预豫驭禺毓伛俣谀谕萸菀蓣揄圄圉嵛狳饫馀庾阈鬻妪妤纡瑜昱觎腴欤於煜熨燠肀聿钰鹆鹬瘐瘀窬窳蜮蝓竽臾舁雩龉鸳渊冤元垣袁原援辕园员圆猿源缘远苑愿怨院塬芫掾圜沅媛瑗橼爰眢鸢螈箢鼋乐说曰约越跃钥岳粤月悦阅龠哕瀹栎樾刖钺员耘云郧匀陨允运蕴酝晕韵孕郓芸狁恽愠纭韫殒昀氲熨筠",
L"匝砸杂扎咋拶咂栽哉灾宰载再在崽甾咱攒暂赞拶瓒昝簪糌趱錾藏赃脏葬驵臧遭糟凿藻枣早澡蚤躁噪造皂灶燥唣责择则泽咋仄赜啧帻迮昃笮箦舴贼怎谮增憎曾赠缯甑罾锃吱兹咨资姿滋淄孜紫仔籽滓子自渍字谘茈嵫姊孳缁梓辎赀恣眦锱秭耔笫粢趑觜訾龇鲻髭鬃棕踪宗综总纵偬枞腙粽邹走奏揍诹陬鄹驺鲰租足卒族祖诅阻组俎菹镞钻纂攥缵躜嘴醉最罪蕞觜尊遵撙樽鳟撮琢昨左佐柞做作坐座阼唑嘬怍胙祚砟酢查扎喳渣札轧铡闸眨栅榨咋乍炸诈柞揸吒咤哳喋楂砟痄蚱龃齄翟择摘斋宅窄债寨砦瘵颤瞻毡詹粘沾盏斩辗崭展蘸栈占战站湛绽谵搌骣旃长樟章彰漳张掌涨杖丈帐账仗胀瘴障仉鄣幛嶂獐嫜璋蟑朝招昭找沼赵照罩兆肇召爪着诏啁棹钊笊遮折哲蛰辙者锗蔗这浙着谪摺柘辄磔鹧褶蜇赭珍斟真甄砧臻贞针侦枕疹诊震振镇阵帧圳蓁浈溱缜桢椹榛轸赈胗朕祯畛稹鸩箴蒸挣睁征狰争怔整拯正政症郑证诤峥徵钲铮筝鲭识芝枝支吱蜘知肢脂汁之织职直植殖执值侄址指止趾只旨纸志挚掷至致置帜峙制智秩稚质炙痔滞治窒卮陟郅埴芷摭帙徵夂忮彘咫骘栉枳栀桎轵轾贽胝膣祉祗黹雉鸷痣蛭絷酯跖踬踯豸觯中盅忠钟衷终种肿重仲众冢忪锺螽舯踵舟周州洲诌粥轴肘帚咒皱宙昼骤荮啁妯纣绉胄碡籀繇酎属术珠株蛛朱猪诸诛逐竹烛煮拄瞩嘱主著柱助蛀贮铸筑住注祝驻丶伫侏邾苎茱洙渚潴杼槠橥炷铢疰瘃褚竺箸舳翥躅麈挝抓爪拽转传专砖转撰赚篆啭馔沌颛幢桩庄装妆撞壮状奘戆椎锥追赘坠缀惴骓缒隹谆准饨肫窀捉拙卓桌琢茁酌啄着灼浊倬诼擢浞涿濯焯禚斫镯"
};

std::string StringUtil::ToLower(const char* s)
{
    if (NULL == s)
    {
        return "";
    }
    std::string result;

    while (char c = *s++)
    {
        result.push_back(tolower(c));
    }
    return result;
}

std::wstring StringUtil::ToLower(const wchar_t* s)
{
    if (NULL == s)
    {
        return L"";
    }
    std::wstring result;

    while (wchar_t c = *s++)
    {
        result.push_back(towlower(c));
    }
    return result;
}

std::string StringUtil::ToUpper(const char* s)
{
    if (NULL == s)
    {
        return "";
    }
    std::string result;

    while (char c = *s++)
    {
        result.push_back(toupper(c));
    }
    return result;
}

std::wstring StringUtil::ToUpper(const wchar_t* s)
{
    if (NULL == s)
    {
        return L"";
    }
    std::wstring result;

    while (wchar_t c = *s++)
    {
        result.push_back(towupper(c));
    }
    return result;
}

std::string StringUtil::ReplaceString(const std::string& source, const char c, const char* dst)
{
	int pos = 0;
	std::string strTmp = source;
    int dstLen = strlen(dst);
	while ((pos = strTmp.find(c, pos)) != std::string::npos)
	{
        strTmp.replace(pos, 1, dst);
        pos += dstLen;
    }
	return strTmp;
}

std::string StringUtil::ReplaceString(const std::string& source, const char* pat, const char* dst)
{
    if (NULL == pat || NULL == dst)
    {
        return source;
    }
	int pos = 0;
	std::string strTmp = source;
    int patLen = strlen(pat);
    int dstLen = strlen(dst);
	while ((pos = strTmp.find(pat, pos)) != std::string::npos)
	{
        strTmp.replace(pos, patLen, dst);
        pos += dstLen;
    }
	return strTmp;
}

std::string StringUtil::EscapeHTML(const char* pConvertStr)
{
	std::string strTmp = pConvertStr;
	ReplaceString(strTmp, '&', "&amp;");
	ReplaceString(strTmp, '<', "&lt;");
	ReplaceString(strTmp, '>', "&gt;");
	ReplaceString(strTmp, '"', "&quot;");
	ReplaceString(strTmp, '\'', "&apos;");
	return strTmp;
}

std::string StringUtil::Trim(const char* pstr)
{
	std::string strTrim = pstr;
	std::string::size_type posStart = strTrim.find_first_not_of(" \r\n\t");
    std::string::size_type posEnd = strTrim.find_last_not_of(" \r\n\t");
	if(posStart == std::string::npos || posEnd == std::string::npos)
	{
		strTrim = "";
	}
	else
	{
		strTrim = strTrim.substr(posStart, posEnd - posStart + 1);
	}
	return strTrim;
}

bool StringUtil::StartWith(const char* src, const char* pat)
{
    if (NULL == src || NULL == pat)
    {
        return false;
    }
    while (*src && *pat && *src == *pat)
    {
        ++src;
        ++pat;
    }
    return 0 == *pat;
}

bool StringUtil::EndWith(const char* src, const char* pat)
{
    if (NULL == src || NULL == pat)
    {
        return false;
    }
    int srcLen = strlen(src);
    int patLen = strlen(pat);
    if (srcLen < patLen)
    {
        return false;
    }
    if (0 == srcLen || 0 == patLen)
    {
        return true;
    }
    const char* srcEnd = src + srcLen - 1;
    const char* patEnd = pat + patLen - 1;
    while (patEnd >= pat && *patEnd == *srcEnd)
    {
        --patEnd;
        --srcEnd;
    }
    return patEnd < pat;
}

int StringUtil::CountsOfChar(const std::string& str, const std::string& pat)
{
    int count = 0;
    int len = pat.size();
    size_t pos = str.find(pat);
    while (pos != std::string::npos)
    {
        count ++;
        pos += (len + 1);
        pos = str.find(pat, pos);
    }

    return count;
}

bool StringUtil::IsValidEmail(const char* email)
{
    if (IsNullOrEmpty(email))
    {
        return false;
    }
    if (strchr(email, ' ') != NULL)
    {
        return false;
    }
    const char* atPos = strchr(email, '@');
    if (NULL == atPos)
    {
        return false;
    }
    const char* at2Pos = strchr(atPos + 1, '@');
    if (NULL != at2Pos)
    {
        return false;
    }
    const char* dotPos = strchr(atPos + 1, '.');
    if (NULL == dotPos || 0 == *(dotPos + 1))
    {
        return false;
    }
    return true;
}

std::vector<std::string> StringUtil::Split(const char* s, const char* seps)
{
    std::vector<std::string> results;
    if (IsNullOrEmpty(s) || IsNullOrEmpty(seps))
    {
        return results;
    };

    const char* tokenBegin = NULL;
    while (*s)
    {
       const char* sepsBegin =  seps;
       while (*sepsBegin && *sepsBegin != *s)
       {
           ++sepsBegin;
       }
       // match seps
       if (*sepsBegin)
       {
           if (NULL != tokenBegin)
           {
               results.push_back(std::string(tokenBegin, s - tokenBegin));
               tokenBegin = NULL;
           }
       }
       else
       {
           // not match seps
           if (NULL == tokenBegin)
           {
               tokenBegin = s;
           }
       }
       ++s;
    }
    if (tokenBegin != NULL)
    {
       results.push_back(Trim(std::string(tokenBegin, s - tokenBegin).c_str()));
    }

    return results;
}

std::string StringUtil::Join(const std::vector<std::string>& ids, const char* seps)
{
    if (ids.empty() || IsNullOrEmpty(seps))
    {
        return "";
    }

    std::string result;
    for (size_t i = 0; i + 1 < ids.size(); ++i)
    {
        result.append(ids[i]).append(seps);
    }
    result.append(ids.back());
    return result;
}

bool StringUtil::MatchByFirstLetter(const std::wstring& src, const std::wstring& dst)
{
	return std::search(src.c_str(), src.c_str() + src.size(), dst.c_str(), dst.c_str() + dst.size(), MatchCharByPinyin) != src.c_str() + src.size();
}

bool StringUtil::MatchCharByPinyin(wchar_t src, wchar_t dst)
{
    if (src == dst)
    {
        return true;
    }
	if(dst < 'a' || dst > 'z')
	{
		return false;
	}
	return wcschr(s_hanCharsByFirstLetter[dst-'a'], src) != NULL;
}

void StringUtil::HideEmailInfo(std::string& src)
{
    if (IsValidEmail(src.c_str()))
    {
        std::vector<std::string> nickLst;
        nickLst = Split(src.c_str(), "@");
        if (nickLst.size() > 0)
        {
            src = nickLst.at(0);
            src += "@...";
        }
    }
}

} // bookstore
} // dk
